app/controllers/comments_controller.rb

	def create
		@comment.user = current_user
		@post = Post.find(params[:id])
		@comment = @post.comments.create( comment_params )
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('DAM DAM', 'dam dam yo\r\n', 1, '2017-07-03 00:56:02', '2017-07-03 00:56:02')