app/controllers/groups_controller.rb

  def index
    @disable_nav = true
    if user_signed_in?
      if params[:group_name]
        @groups = Group.group_name_with(params[:group_name])
---
SELECT `groups`.* FROM `groups`