app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    if params[:tag]
      @posts = Post.tagged_with(params[:tag])
    else
      @posts = Post.all

UPDATE `posts` SET `post` = 'checkjlkj\r\n', `updated_at` = '2017-07-03 04:08:20' WHERE `posts`.`id` = 1
---
  def update
    respond_to do |format|
      if @post.save