app/controllers/users_controller.rb

INSERT INTO `users` (`username`, `password`, `email`, `created_at`, `updated_at`) VALUES ('asdf', 'fda', 'adsf', '2017-06-23 17:26:55', '2017-06-23 17:26:55')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save